{
    "number": "4",
    "title": "BFD Control Packet Format",
    "content": "",
    "summary": "Here are the one-sentence summaries for each section:\n\n1. This section describes the comprehensive structure and field specifications of BFD Control packets with both required and optional authentication components.\n\n2. This section describes the Simple Password Authentication Section's structure with its four key components used in packet authentication.\n\n3. This section describes the MD5-based authentication formats and fields while acknowledging its deprecated status.\n\n4. This section describes the SHA1-based authentication section format and its component fields used in network protocol security.",
    "format": "./everparse/everparse_files/BFD7/BFD7.3d",
    "children": [
        {
            "number": "4.1",
            "title": "Generic BFD Control Packet Format",
            "content": "BFD Control packets are sent in an encapsulation appropriate to the\n   environment.  The specific encapsulation is outside of the scope of\n   this specification.  See the appropriate application document for\n   encapsulation details.\n   The BFD Control packet has a Mandatory Section and an optional\n   Authentication Section.  The format of the Authentication Section, if\n   present, is dependent on the type of authentication in use.\n   The Mandatory Section of a BFD Control packet has the following\n   format:\n    0                   1                   2                   3\n    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   |Vers |  Diag   |Sta|P|F|C|A|D|M|  Detect Mult  |    Length     |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   |                       My Discriminator                        |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   |                      Your Discriminator                       |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   |                    Desired Min TX Interval                    |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   |                   Required Min RX Interval                    |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   |                 Required Min Echo RX Interval                 |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   An optional Authentication Section MAY be present:\n    0                   1                   2                   3\n    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   |   Auth Type   |   Auth Len    |    Authentication Data...     |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   Version (Vers)\n      The version number of the protocol.  This document defines\n      protocol version 1.\n   Diagnostic (Diag)\n      A diagnostic code specifying the local system's reason for the\n      last change in session state.  Values are:\n         0 -- No Diagnostic\n         1 -- Control Detection Time Expired\n         2 -- Echo Function Failed\n         3 -- Neighbor Signaled Session Down\n         4 -- Forwarding Plane Reset\n         5 -- Path Down\n         6 -- Concatenated Path Down\n         7 -- Administratively Down\n         8 -- Reverse Concatenated Path Down\n      9-31 -- Reserved for future use\n      This field allows remote systems to determine the reason that the\n      previous session failed, for example.\n   State (Sta)\n      The current BFD session state as seen by the transmitting system.\n      Values are:\n         0 -- AdminDown\n         1 -- Down\n         2 -- Init\n         3 -- Up\n   Poll (P)\n      If set, the transmitting system is requesting verification of\n      connectivity, or of a parameter change, and is expecting a packet\n      with the Final (F) bit in reply.  If clear, the transmitting\n      system is not requesting verification.\n   Final (F)\n      If set, the transmitting system is responding to a received BFD\n      Control packet that had the Poll (P) bit set.  If clear, the\n      transmitting system is not responding to a Poll.\n   Control Plane Independent (C)\n      If set, the transmitting system's BFD implementation does not\n      share fate with its control plane (in other words, BFD is\n      implemented in the forwarding plane and can continue to function\n      through disruptions in the control plane).  If clear, the\n      transmitting system's BFD implementation shares fate with its\n      control plane.\n      The use of this bit is application dependent and is outside the\n      scope of this specification.  See specific application\n      specifications for details.\n   Authentication Present (A)\n      If set, the Authentication Section is present and the session is\n      to be authenticated (see section 6.7 for details).\n   Demand (D)\n      If set, Demand mode is active in the transmitting system (the\n      system wishes to operate in Demand mode, knows that the session is\n      Up in both directions, and is directing the remote system to cease\n      the periodic transmission of BFD Control packets).  If clear,\n      Demand mode is not active in the transmitting system.\n   Multipoint (M)\n      This bit is reserved for future point-to-multipoint extensions to\n      BFD.  It MUST be zero on both transmit and receipt.\n   Detect Mult\n      Detection time multiplier.  The negotiated transmit interval,\n      multiplied by this value, provides the Detection Time for the\n      receiving system in Asynchronous mode.\n   Length\n      Length of the BFD Control packet, in bytes.\n   My Discriminator\n      A unique, nonzero discriminator value generated by the\n      transmitting system, used to demultiplex multiple BFD sessions\n      between the same pair of systems.\n   Your Discriminator\n      The discriminator received from the corresponding remote system.\n      This field reflects back the received value of My Discriminator,\n      or is zero if that value is unknown.\n   Desired Min TX Interval\n      This is the minimum interval, in microseconds, that the local\n      system would like to use when transmitting BFD Control packets,\n      less any jitter applied (see section 6.8.2).  The value zero is\n      reserved.\n   Required Min RX Interval\n      This is the minimum interval, in microseconds, between received\n      BFD Control packets that this system is capable of supporting,\n      less any jitter applied by the sender (see section 6.8.2).  If\n      this value is zero, the transmitting system does not want the\n      remote system to send any periodic BFD Control packets.\n   Required Min Echo RX Interval\n      This is the minimum interval, in microseconds, between received\n      BFD Echo packets that this system is capable of supporting, less\n      any jitter applied by the sender (see section 6.8.9).  If this\n      value is zero, the transmitting system does not support the\n      receipt of BFD Echo packets.\n   Auth Type\n      The authentication type in use, if the Authentication Present (A)\n      bit is set.\n         0 - Reserved\n         1 - Simple Password\n         2 - Keyed MD5\n         3 - Meticulous Keyed MD5\n         4 - Keyed SHA1\n         5 - Meticulous Keyed SHA1\n     6-255 - Reserved for future use\n   Auth Len\n      The length, in bytes, of the authentication section, including the\n      Auth Type and Auth Len fields.",
            "summary": "This section describes the detailed format and field definitions of BFD (Bidirectional Forwarding Detection) Control packets, including both mandatory and optional authentication sections, with explanations for each field's purpose and possible values.",
            "format": "./everparse/everparse_files/BFD/BFD.3d",
            "children": []
        },
        {
            "number": "4.2",
            "title": "Simple Password Authentication Section Format",
            "content": "If the Authentication Present (A) bit is set in the header, and the\n   Authentication Type field contains 1 (Simple Password), the\n   Authentication Section has the following format:\n    0                   1                   2                   3\n    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   |   Auth Type   |   Auth Len    |  Auth Key ID  |  Password...  |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   |                              ...                              |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   Auth Type\n      The Authentication Type, which in this case is 1 (Simple\n      Password).\n   Auth Len\n      The length of the Authentication Section, in bytes.  For Simple\n      Password authentication, the length is equal to the password\n      length plus three.\n   Auth Key ID\n      The authentication key ID in use for this packet.  This allows\n      multiple keys to be active simultaneously.\n   Password\n      The simple password in use on this session.  The password is a\n      binary string, and MUST be from 1 to 16 bytes in length.  The\n      password MUST be encoded and configured according to section\n      6.7.2.",
            "summary": "This section describes the format and components of a Simple Password Authentication Section used in packet headers, including fields for Auth Type (1), Auth Len (password length plus three), Auth Key ID, and a 1-16 byte binary password.",
            "format": "./everparse/everparse_files/SIMPLE_PASSWORD_AUTH/SIMPLE_PASSWORD_AUTH.3d",
            "children": []
        },
        {
            "number": "4.3",
            "title": "Keyed MD5 and Meticulous Keyed MD5 Authentication Section Format",
            "content": "The use of MD5-based authentication is strongly discouraged.\n   However, it is documented here for compatibility with existing\n   implementations.\n   If the Authentication Present (A) bit is set in the header, and the\n   Authentication Type field contains 2 (Keyed MD5) or 3 (Meticulous\n   Keyed MD5), the Authentication Section has the following format:\n    0                   1                   2                   3\n    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   |   Auth Type   |   Auth Len    |  Auth Key ID  |   Reserved    |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   |                        Sequence Number                        |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   |                      Auth Key/Digest...                       |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   |                              ...                              |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   Auth Type\n      The Authentication Type, which in this case is 2 (Keyed MD5) or 3\n      (Meticulous Keyed MD5).\n   Auth Len\n      The length of the Authentication Section, in bytes.  For Keyed MD5\n      and Meticulous Keyed MD5 authentication, the length is 24.\n   Auth Key ID\n      The authentication key ID in use for this packet.  This allows\n      multiple keys to be active simultaneously.\n   Reserved\n      This byte MUST be set to zero on transmit, and ignored on receipt.\n   Sequence Number\n      The sequence number for this packet.  For Keyed MD5\n      Authentication, this value is incremented occasionally.  For\n      Meticulous Keyed MD5 Authentication, this value is incremented for\n      each successive packet transmitted for a session.  This provides\n      protection against replay attacks.\n   Auth Key/Digest\n      This field carries the 16-byte MD5 digest for the packet.  When\n      the digest is calculated, the shared MD5 key is stored in this\n      field, padded to 16 bytes with trailing zero bytes if needed.  The\n      shared key MUST be encoded and configured to section 6.7.3.",
            "summary": "This section describes the format and components of Keyed MD5 and Meticulous Keyed MD5 authentication sections in network packets, including fields for authentication type, length, key ID, sequence number, and MD5 digest, while noting that MD5-based authentication is discouraged but documented for compatibility.",
            "format": "./everparse/everparse_files/MD5AUTH/MD5AUTH.3d",
            "children": []
        },
        {
            "number": "4.4",
            "title": "Keyed SHA1 and Meticulous Keyed SHA1 Authentication Section Format",
            "content": "If the Authentication Present (A) bit is set in the header, and the\n   Authentication Type field contains 4 (Keyed SHA1) or 5 (Meticulous\n   Keyed SHA1), the Authentication Section has the following format:\n    0                   1                   2                   3\n    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   |   Auth Type   |   Auth Len    |  Auth Key ID  |   Reserved    |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   |                        Sequence Number                        |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   |                       Auth Key/Hash...                        |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   |                              ...                              |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   Auth Type\n      The Authentication Type, which in this case is 4 (Keyed SHA1) or 5\n      (Meticulous Keyed SHA1).\n   Auth Len\n      The length of the Authentication Section, in bytes.  For Keyed\n      SHA1 and Meticulous Keyed SHA1 authentication, the length is 28.\n   Auth Key ID\n      The authentication key ID in use for this packet.  This allows\n      multiple keys to be active simultaneously.\n   Reserved\n      This byte MUST be set to zero on transmit and ignored on receipt.\n   Sequence Number\n      The sequence number for this packet.  For Keyed SHA1\n      Authentication, this value is incremented occasionally.  For\n      Meticulous Keyed SHA1 Authentication, this value is incremented\n      for each successive packet transmitted for a session.  This\n      provides protection against replay attacks.\n   Auth Key/Hash\n      This field carries the 20-byte SHA1 hash for the packet.  When the\n      hash is calculated, the shared SHA1 key is stored in this field,\n      padded to a length of 20 bytes with trailing zero bytes if needed.\n      The shared key MUST be encoded and configured to section 6.7.4.",
            "summary": "This section describes the format and components of the Authentication Section when using Keyed SHA1 or Meticulous Keyed SHA1 authentication types in a network protocol, including fields for authentication type, length, key ID, sequence number, and hash value.",
            "format": "./everparse/everparse_files/AUTH/AUTH.3d",
            "children": []
        }
    ]
}